#======================================================
#
# Synopsys Synthesis Scripts (Design Vision dctcl mode)
#
#======================================================
#======================================================
# (A) Global Parameters
#======================================================
set DESIGN "DESIGN"
DESIGN
set CYCLE 10
10
set INPUT_DLY [expr 0.5*$CYCLE]
5.0
set OUTPUT_DLY [expr 0.5*$CYCLE]
5.0
#======================================================
# (B) Read RTL Code
#======================================================
# (B-1) analyze + elaborate
set hdlin_auto_save_templates TRUE
TRUE
analyze -f sverilog $DESIGN\.v 
Running PRESTO HDLC
Compiling source file ../01_RTL/DESIGN.v
Warning:  ../01_RTL/DESIGN.v:190: Forward references to 'sbox' are non-standard. This may be treated as an error in the future. (VER-733)
Warning:  ../01_RTL/DESIGN.v:219: Forward references to 'rcon' are non-standard. This may be treated as an error in the future. (VER-733)
Warning:  ../01_RTL/DESIGN.v:250: The statements in initial blocks are ignored. (VER-281)
Warning:  ../01_RTL/DESIGN.v:254: The statements in initial blocks are ignored. (VER-281)
Warning:  ../01_RTL/DESIGN.v:275: Forward references to 'sbox' are non-standard. This may be treated as an error in the future. (VER-733)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
Error:  ../01_RTL/DESIGN.v:320: symbol i must be a constant or parameter. (VER-260)
*** Presto compilation terminated with 8 errors. ***
Loading db file '/RAID2/COURSE/BackUp/2023_Spring/iclab/iclabta01/UMC018_CBDK/CIC/SynopsysDC/db/fsa0m_a_generic_core_ss1p62v125c.db'
Loading db file '/RAID2/COURSE/BackUp/2023_Spring/iclab/iclabta01/UMC018_CBDK/CIC/SynopsysDC/db/fsa0m_a_generic_core_ff1p98vm40c.db'
Loading db file '/RAID2/COURSE/BackUp/2023_Spring/iclab/iclabta01/UMC018_CBDK/CIC/SynopsysDC/db/fsa0m_a_t33_generic_io_ss1p62v125c.db'
Loading db file '/RAID2/COURSE/BackUp/2023_Spring/iclab/iclabta01/UMC018_CBDK/CIC/SynopsysDC/db/fsa0m_a_t33_generic_io_tt1p8v25c.db'
Loading db file '/usr/cad/synopsys/synthesis/cur/libraries/syn/dw_foundation.sldb'
Loading db file '/usr/cad/synopsys/synthesis/cur/libraries/syn/standard.sldb'
0
elaborate $DESIGN  
Loading db file '/usr/cad/synopsys/synthesis/2022.03/libraries/syn/gtech.db'
Loading db file '/usr/cad/synopsys/synthesis/2022.03/libraries/syn/standard.sldb'
  Loading link library 'fsa0m_a_generic_core_ss1p62v125c'
  Loading link library 'fsa0m_a_generic_core_ff1p98vm40c'
  Loading link library 'fsa0m_a_t33_generic_io_ss1p62v125c'
  Loading link library 'fsa0m_a_t33_generic_io_tt1p8v25c'
  Loading link library 'gtech'
Running PRESTO HDLC
Error:  ../01_RTL/DESIGN.v:62: Enumerated type member ROUND_6 duplicates a previously seen value 0. (VER-508)
Error:  ../01_RTL/DESIGN.v:63: Enumerated type member ROUND_7 duplicates a previously seen value 1. (VER-508)
Error:  ../01_RTL/DESIGN.v:64: Enumerated type member ROUND_8 duplicates a previously seen value 2. (VER-508)
Error:  ../01_RTL/DESIGN.v:65: Enumerated type member ROUND_9 duplicates a previously seen value 3. (VER-508)
Error:  ../01_RTL/DESIGN.v:66: Enumerated type member ROUND_10 duplicates a previously seen value 4. (VER-508)
Error:  ../01_RTL/DESIGN.v:67: Enumerated type member OUTPUT duplicates a previously seen value 5. (VER-508)
*** Presto compilation terminated with 7 errors. ***
0
# (B-2) read_sverilog
#read_sverilog $DESIGN\.v
# (B-3) set current design
current_design $DESIGN
Error: Can't find design 'DESIGN'. (UID-109)
Error: Current design is not defined. (UID-4)
link
Error: Current design is not defined. (UID-4)
0
#======================================================
#  (C) Global Setting
#======================================================
set_wire_load_mode top
Error: Current design is not defined. (UID-4)
0
# set_operating_conditions -max WCCOM -min BCCOM
# set_wire_load_model -name umc18_wl10 -library slow
#======================================================
#  (D) Set Design Constraints
#======================================================
# (D-1) Setting Clock Constraints
create_clock -name clk -period $CYCLE [get_ports clk] 
Error: Current design is not defined. (UID-4)
Error: Can't find port 'clk'. (UID-109)
Error: Value for list 'source_objects' must have 1 elements. (CMD-036)
0
set_dont_touch_network             [get_clocks clk]
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '<object_list>' must have 1 elements. (CMD-036)
0
set_fix_hold                       [get_clocks clk]
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
0
set_clock_uncertainty       0.1    [get_clocks clk]
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
# set_clock_latency   -source 0      [get_clocks clk]
# set_clock_latency           1      [get_clocks clk] 
set_input_transition        0.5    [all_inputs] 
Error: Current design is not defined. (UID-4)
Error: Value for list 'port_list' must have 1 elements. (CMD-036)
0
set_clock_transition        0.1    [all_clocks] 
Error: Current design is not defined. (UID-4)
Error: Value for list 'clock_list' must have 1 elements. (CMD-036)
0
# (D-2) Setting in/out Constraints
set_input_delay   -max  $INPUT_DLY  -clock clk   [all_inputs] ;  # set_up time check 
Error: Current design is not defined. (UID-4)
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_input_delay   -min  0           -clock clk   [all_inputs] ;  # hold   time check 
Error: Current design is not defined. (UID-4)
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_output_delay  -max  $OUTPUT_DLY -clock clk   [all_outputs] ; # set_up time check 
Error: Current design is not defined. (UID-4)
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_output_delay  -min  0           -clock clk   [all_outputs] ; # hold   time check 
Error: Current design is not defined. (UID-4)
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_input_delay 0 -clock clk clk
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Current design is not defined. (UID-4)
Error: Can't find object 'clk'. (UID-109)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_input_delay 0 -clock clk rst_n
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Current design is not defined. (UID-4)
Error: Can't find object 'rst_n'. (UID-109)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
#set_max_delay $CYCLE -from [all_inputs] -to [all_outputs]
# (D-3) Setting Design Environment
# set_driving_cell -library umc18io3v5v_slow -lib_cell P2C    -pin {Y}  [get_ports clk]
# set_driving_cell -library umc18io3v5v_slow -lib_cell P2C    -pin {Y}  [remove_from_collection [all_inputs] [get_ports clk]]
# set_load  [load_of "umc18io3v5v_slow/P8C/A"]       [all_outputs] ; # ~= 0.038
set_load 0.05 [all_outputs]
Error: Current design is not defined. (UID-4)
Error: Value for list 'objects' must have 1 elements. (CMD-036)
0
# (D-4) Setting DRC Constraint
#set_max_delay           0     ; # Optimize delay max effort                 
#set_max_area            0      ; # Optimize area max effort           
set_max_transition      3       [all_inputs]   ; # U18 LUT Max Transition Value  
Error: Current design is not defined. (UID-4)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
set_max_capacitance     0.15    [all_inputs]   ; # U18 LUT Max Capacitance Value
Error: Current design is not defined. (UID-4)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
set_max_fanout          10      [all_inputs]
Error: Current design is not defined. (UID-4)
Error: Value for list 'object_list' must have 1 elements. (CMD-036)
0
# set_dont_use slow/JKFF*
#set_dont_touch [get_cells core_reg_macro]
#set hdlin_ff_always_sync_set_reset true
# (D-5) Report Clock skew
report_clock -skew clk
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list 'clock_list' must have 1 elements. (CMD-036)
0
check_timing
Error: Current design is not defined. (UID-4)
0
#======================================================
#  (E) Optimization
#======================================================
check_design > Report/$DESIGN\.check
set_fix_multiple_port_nets -all -buffer_constants [get_designs *]
Error: Can't find designs matching '*'. (UID-109)
Error: Value for list 'design_list' must have 1 elements. (CMD-036)
0
set_fix_hold [all_clocks]
Error: Current design is not defined. (UID-4)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
0
compile_ultra
Error: Current design is not defined. (UID-4)
0
#uniquify
#compile
#======================================================
#  (F) Output Reports 
#======================================================
report_design  >  Report/$DESIGN\.design
report_resource >  Report/$DESIGN\.resource
report_timing -max_paths 3 >  Report/$DESIGN\.timing
report_area >  Report/$DESIGN\.area
report_power > Report/$DESIGN\.power
report_clock > Report/$DESIGN\.clock
report_port >  Report/$DESIGN\.port
report_power >  Report/$DESIGN\.power
#report_reference > Report/$DESIGN\.reference
#======================================================
#  (G) Change Naming Rule
#======================================================
set bus_inference_style "%s\[%d\]"
%s[%d]
set bus_naming_style "%s\[%d\]"
%s[%d]
set hdlout_internal_busses true
true
change_names -hierarchy -rule verilog
Error: Current design is not defined. (UID-4)
0
define_name_rules name_rule -allowed "a-z A-Z 0-9 _" -max_length 255 -type cell
1
define_name_rules name_rule -allowed "a-z A-Z 0-9 _[]" -max_length 255 -type net
1
define_name_rules name_rule -map {{"\\*cell\\*" "cell"}}
1
define_name_rules name_rule -case_insensitive
1
change_names -hierarchy -rules name_rule
Error: Current design is not defined. (UID-4)
0
#======================================================
#  (H) Output Results
#======================================================
set verilogout_higher_designs_first true
true
write -format verilog -output Netlist/$DESIGN\_SYN.v -hierarchy
Error: No files or designs were specified. (UID-22)
0
write -format ddc     -hierarchy -output $DESIGN\_SYN.ddc
Error: No files or designs were specified. (UID-22)
0
write_sdf -version 3.0 -context verilog -load_delay cell Netlist/$DESIGN\_SYN.sdf -significant_digits 6
Error: Current design is not defined. (UID-4)
0
write_sdc Netlist/$DESIGN\_SYN.sdc
Error: Current design is not defined. (UID-4)
0
#======================================================
#  (I) Finish and Quit
#======================================================
report_area
Error: Current design is not defined. (UID-4)
0
report_timing 
Error: Current design is not defined. (UID-4)
0
exit

Memory usage for this session 170 Mbytes.
Memory usage for this session including child processes 170 Mbytes.
CPU usage for this session 2 seconds ( 0.00 hours ).
Elapsed time for this session 4 seconds ( 0.00 hours ).

Thank you...

