###################################################################

# Created by write_sdc on Tue Mar 25 17:37:40 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name enG10K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.05 [get_ports {real_out[31]}]
set_load -pin_load 0.05 [get_ports {real_out[30]}]
set_load -pin_load 0.05 [get_ports {real_out[29]}]
set_load -pin_load 0.05 [get_ports {real_out[28]}]
set_load -pin_load 0.05 [get_ports {real_out[27]}]
set_load -pin_load 0.05 [get_ports {real_out[26]}]
set_load -pin_load 0.05 [get_ports {real_out[25]}]
set_load -pin_load 0.05 [get_ports {real_out[24]}]
set_load -pin_load 0.05 [get_ports {real_out[23]}]
set_load -pin_load 0.05 [get_ports {real_out[22]}]
set_load -pin_load 0.05 [get_ports {real_out[21]}]
set_load -pin_load 0.05 [get_ports {real_out[20]}]
set_load -pin_load 0.05 [get_ports {real_out[19]}]
set_load -pin_load 0.05 [get_ports {real_out[18]}]
set_load -pin_load 0.05 [get_ports {real_out[17]}]
set_load -pin_load 0.05 [get_ports {real_out[16]}]
set_load -pin_load 0.05 [get_ports {real_out[15]}]
set_load -pin_load 0.05 [get_ports {real_out[14]}]
set_load -pin_load 0.05 [get_ports {real_out[13]}]
set_load -pin_load 0.05 [get_ports {real_out[12]}]
set_load -pin_load 0.05 [get_ports {real_out[11]}]
set_load -pin_load 0.05 [get_ports {real_out[10]}]
set_load -pin_load 0.05 [get_ports {real_out[9]}]
set_load -pin_load 0.05 [get_ports {real_out[8]}]
set_load -pin_load 0.05 [get_ports {real_out[7]}]
set_load -pin_load 0.05 [get_ports {real_out[6]}]
set_load -pin_load 0.05 [get_ports {real_out[5]}]
set_load -pin_load 0.05 [get_ports {real_out[4]}]
set_load -pin_load 0.05 [get_ports {real_out[3]}]
set_load -pin_load 0.05 [get_ports {real_out[2]}]
set_load -pin_load 0.05 [get_ports {real_out[1]}]
set_load -pin_load 0.05 [get_ports {real_out[0]}]
set_load -pin_load 0.05 [get_ports {imag_out[31]}]
set_load -pin_load 0.05 [get_ports {imag_out[30]}]
set_load -pin_load 0.05 [get_ports {imag_out[29]}]
set_load -pin_load 0.05 [get_ports {imag_out[28]}]
set_load -pin_load 0.05 [get_ports {imag_out[27]}]
set_load -pin_load 0.05 [get_ports {imag_out[26]}]
set_load -pin_load 0.05 [get_ports {imag_out[25]}]
set_load -pin_load 0.05 [get_ports {imag_out[24]}]
set_load -pin_load 0.05 [get_ports {imag_out[23]}]
set_load -pin_load 0.05 [get_ports {imag_out[22]}]
set_load -pin_load 0.05 [get_ports {imag_out[21]}]
set_load -pin_load 0.05 [get_ports {imag_out[20]}]
set_load -pin_load 0.05 [get_ports {imag_out[19]}]
set_load -pin_load 0.05 [get_ports {imag_out[18]}]
set_load -pin_load 0.05 [get_ports {imag_out[17]}]
set_load -pin_load 0.05 [get_ports {imag_out[16]}]
set_load -pin_load 0.05 [get_ports {imag_out[15]}]
set_load -pin_load 0.05 [get_ports {imag_out[14]}]
set_load -pin_load 0.05 [get_ports {imag_out[13]}]
set_load -pin_load 0.05 [get_ports {imag_out[12]}]
set_load -pin_load 0.05 [get_ports {imag_out[11]}]
set_load -pin_load 0.05 [get_ports {imag_out[10]}]
set_load -pin_load 0.05 [get_ports {imag_out[9]}]
set_load -pin_load 0.05 [get_ports {imag_out[8]}]
set_load -pin_load 0.05 [get_ports {imag_out[7]}]
set_load -pin_load 0.05 [get_ports {imag_out[6]}]
set_load -pin_load 0.05 [get_ports {imag_out[5]}]
set_load -pin_load 0.05 [get_ports {imag_out[4]}]
set_load -pin_load 0.05 [get_ports {imag_out[3]}]
set_load -pin_load 0.05 [get_ports {imag_out[2]}]
set_load -pin_load 0.05 [get_ports {imag_out[1]}]
set_load -pin_load 0.05 [get_ports {imag_out[0]}]
set_max_capacitance 0.15 [get_ports {real_in[15]}]
set_max_capacitance 0.15 [get_ports {real_in[14]}]
set_max_capacitance 0.15 [get_ports {real_in[13]}]
set_max_capacitance 0.15 [get_ports {real_in[12]}]
set_max_capacitance 0.15 [get_ports {real_in[11]}]
set_max_capacitance 0.15 [get_ports {real_in[10]}]
set_max_capacitance 0.15 [get_ports {real_in[9]}]
set_max_capacitance 0.15 [get_ports {real_in[8]}]
set_max_capacitance 0.15 [get_ports {real_in[7]}]
set_max_capacitance 0.15 [get_ports {real_in[6]}]
set_max_capacitance 0.15 [get_ports {real_in[5]}]
set_max_capacitance 0.15 [get_ports {real_in[4]}]
set_max_capacitance 0.15 [get_ports {real_in[3]}]
set_max_capacitance 0.15 [get_ports {real_in[2]}]
set_max_capacitance 0.15 [get_ports {real_in[1]}]
set_max_capacitance 0.15 [get_ports {real_in[0]}]
set_max_capacitance 0.15 [get_ports {imag_in[15]}]
set_max_capacitance 0.15 [get_ports {imag_in[14]}]
set_max_capacitance 0.15 [get_ports {imag_in[13]}]
set_max_capacitance 0.15 [get_ports {imag_in[12]}]
set_max_capacitance 0.15 [get_ports {imag_in[11]}]
set_max_capacitance 0.15 [get_ports {imag_in[10]}]
set_max_capacitance 0.15 [get_ports {imag_in[9]}]
set_max_capacitance 0.15 [get_ports {imag_in[8]}]
set_max_capacitance 0.15 [get_ports {imag_in[7]}]
set_max_capacitance 0.15 [get_ports {imag_in[6]}]
set_max_capacitance 0.15 [get_ports {imag_in[5]}]
set_max_capacitance 0.15 [get_ports {imag_in[4]}]
set_max_capacitance 0.15 [get_ports {imag_in[3]}]
set_max_capacitance 0.15 [get_ports {imag_in[2]}]
set_max_capacitance 0.15 [get_ports {imag_in[1]}]
set_max_capacitance 0.15 [get_ports {imag_in[0]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[15]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[14]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[13]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[12]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[11]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[10]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[9]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[8]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[7]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[6]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[5]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[4]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[3]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[2]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[1]}]
set_max_capacitance 0.15 [get_ports {twiddle_real[0]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[15]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[14]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[13]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[12]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[11]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[10]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[9]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[8]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[7]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[6]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[5]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[4]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[3]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[2]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[1]}]
set_max_capacitance 0.15 [get_ports {twiddle_imag[0]}]
set_max_fanout 10 [get_ports {real_in[15]}]
set_max_fanout 10 [get_ports {real_in[14]}]
set_max_fanout 10 [get_ports {real_in[13]}]
set_max_fanout 10 [get_ports {real_in[12]}]
set_max_fanout 10 [get_ports {real_in[11]}]
set_max_fanout 10 [get_ports {real_in[10]}]
set_max_fanout 10 [get_ports {real_in[9]}]
set_max_fanout 10 [get_ports {real_in[8]}]
set_max_fanout 10 [get_ports {real_in[7]}]
set_max_fanout 10 [get_ports {real_in[6]}]
set_max_fanout 10 [get_ports {real_in[5]}]
set_max_fanout 10 [get_ports {real_in[4]}]
set_max_fanout 10 [get_ports {real_in[3]}]
set_max_fanout 10 [get_ports {real_in[2]}]
set_max_fanout 10 [get_ports {real_in[1]}]
set_max_fanout 10 [get_ports {real_in[0]}]
set_max_fanout 10 [get_ports {imag_in[15]}]
set_max_fanout 10 [get_ports {imag_in[14]}]
set_max_fanout 10 [get_ports {imag_in[13]}]
set_max_fanout 10 [get_ports {imag_in[12]}]
set_max_fanout 10 [get_ports {imag_in[11]}]
set_max_fanout 10 [get_ports {imag_in[10]}]
set_max_fanout 10 [get_ports {imag_in[9]}]
set_max_fanout 10 [get_ports {imag_in[8]}]
set_max_fanout 10 [get_ports {imag_in[7]}]
set_max_fanout 10 [get_ports {imag_in[6]}]
set_max_fanout 10 [get_ports {imag_in[5]}]
set_max_fanout 10 [get_ports {imag_in[4]}]
set_max_fanout 10 [get_ports {imag_in[3]}]
set_max_fanout 10 [get_ports {imag_in[2]}]
set_max_fanout 10 [get_ports {imag_in[1]}]
set_max_fanout 10 [get_ports {imag_in[0]}]
set_max_fanout 10 [get_ports {twiddle_real[15]}]
set_max_fanout 10 [get_ports {twiddle_real[14]}]
set_max_fanout 10 [get_ports {twiddle_real[13]}]
set_max_fanout 10 [get_ports {twiddle_real[12]}]
set_max_fanout 10 [get_ports {twiddle_real[11]}]
set_max_fanout 10 [get_ports {twiddle_real[10]}]
set_max_fanout 10 [get_ports {twiddle_real[9]}]
set_max_fanout 10 [get_ports {twiddle_real[8]}]
set_max_fanout 10 [get_ports {twiddle_real[7]}]
set_max_fanout 10 [get_ports {twiddle_real[6]}]
set_max_fanout 10 [get_ports {twiddle_real[5]}]
set_max_fanout 10 [get_ports {twiddle_real[4]}]
set_max_fanout 10 [get_ports {twiddle_real[3]}]
set_max_fanout 10 [get_ports {twiddle_real[2]}]
set_max_fanout 10 [get_ports {twiddle_real[1]}]
set_max_fanout 10 [get_ports {twiddle_real[0]}]
set_max_fanout 10 [get_ports {twiddle_imag[15]}]
set_max_fanout 10 [get_ports {twiddle_imag[14]}]
set_max_fanout 10 [get_ports {twiddle_imag[13]}]
set_max_fanout 10 [get_ports {twiddle_imag[12]}]
set_max_fanout 10 [get_ports {twiddle_imag[11]}]
set_max_fanout 10 [get_ports {twiddle_imag[10]}]
set_max_fanout 10 [get_ports {twiddle_imag[9]}]
set_max_fanout 10 [get_ports {twiddle_imag[8]}]
set_max_fanout 10 [get_ports {twiddle_imag[7]}]
set_max_fanout 10 [get_ports {twiddle_imag[6]}]
set_max_fanout 10 [get_ports {twiddle_imag[5]}]
set_max_fanout 10 [get_ports {twiddle_imag[4]}]
set_max_fanout 10 [get_ports {twiddle_imag[3]}]
set_max_fanout 10 [get_ports {twiddle_imag[2]}]
set_max_fanout 10 [get_ports {twiddle_imag[1]}]
set_max_fanout 10 [get_ports {twiddle_imag[0]}]
set_max_transition 3 [get_ports {real_in[15]}]
set_max_transition 3 [get_ports {real_in[14]}]
set_max_transition 3 [get_ports {real_in[13]}]
set_max_transition 3 [get_ports {real_in[12]}]
set_max_transition 3 [get_ports {real_in[11]}]
set_max_transition 3 [get_ports {real_in[10]}]
set_max_transition 3 [get_ports {real_in[9]}]
set_max_transition 3 [get_ports {real_in[8]}]
set_max_transition 3 [get_ports {real_in[7]}]
set_max_transition 3 [get_ports {real_in[6]}]
set_max_transition 3 [get_ports {real_in[5]}]
set_max_transition 3 [get_ports {real_in[4]}]
set_max_transition 3 [get_ports {real_in[3]}]
set_max_transition 3 [get_ports {real_in[2]}]
set_max_transition 3 [get_ports {real_in[1]}]
set_max_transition 3 [get_ports {real_in[0]}]
set_max_transition 3 [get_ports {imag_in[15]}]
set_max_transition 3 [get_ports {imag_in[14]}]
set_max_transition 3 [get_ports {imag_in[13]}]
set_max_transition 3 [get_ports {imag_in[12]}]
set_max_transition 3 [get_ports {imag_in[11]}]
set_max_transition 3 [get_ports {imag_in[10]}]
set_max_transition 3 [get_ports {imag_in[9]}]
set_max_transition 3 [get_ports {imag_in[8]}]
set_max_transition 3 [get_ports {imag_in[7]}]
set_max_transition 3 [get_ports {imag_in[6]}]
set_max_transition 3 [get_ports {imag_in[5]}]
set_max_transition 3 [get_ports {imag_in[4]}]
set_max_transition 3 [get_ports {imag_in[3]}]
set_max_transition 3 [get_ports {imag_in[2]}]
set_max_transition 3 [get_ports {imag_in[1]}]
set_max_transition 3 [get_ports {imag_in[0]}]
set_max_transition 3 [get_ports {twiddle_real[15]}]
set_max_transition 3 [get_ports {twiddle_real[14]}]
set_max_transition 3 [get_ports {twiddle_real[13]}]
set_max_transition 3 [get_ports {twiddle_real[12]}]
set_max_transition 3 [get_ports {twiddle_real[11]}]
set_max_transition 3 [get_ports {twiddle_real[10]}]
set_max_transition 3 [get_ports {twiddle_real[9]}]
set_max_transition 3 [get_ports {twiddle_real[8]}]
set_max_transition 3 [get_ports {twiddle_real[7]}]
set_max_transition 3 [get_ports {twiddle_real[6]}]
set_max_transition 3 [get_ports {twiddle_real[5]}]
set_max_transition 3 [get_ports {twiddle_real[4]}]
set_max_transition 3 [get_ports {twiddle_real[3]}]
set_max_transition 3 [get_ports {twiddle_real[2]}]
set_max_transition 3 [get_ports {twiddle_real[1]}]
set_max_transition 3 [get_ports {twiddle_real[0]}]
set_max_transition 3 [get_ports {twiddle_imag[15]}]
set_max_transition 3 [get_ports {twiddle_imag[14]}]
set_max_transition 3 [get_ports {twiddle_imag[13]}]
set_max_transition 3 [get_ports {twiddle_imag[12]}]
set_max_transition 3 [get_ports {twiddle_imag[11]}]
set_max_transition 3 [get_ports {twiddle_imag[10]}]
set_max_transition 3 [get_ports {twiddle_imag[9]}]
set_max_transition 3 [get_ports {twiddle_imag[8]}]
set_max_transition 3 [get_ports {twiddle_imag[7]}]
set_max_transition 3 [get_ports {twiddle_imag[6]}]
set_max_transition 3 [get_ports {twiddle_imag[5]}]
set_max_transition 3 [get_ports {twiddle_imag[4]}]
set_max_transition 3 [get_ports {twiddle_imag[3]}]
set_max_transition 3 [get_ports {twiddle_imag[2]}]
set_max_transition 3 [get_ports {twiddle_imag[1]}]
set_max_transition 3 [get_ports {twiddle_imag[0]}]
set_input_transition -max 0.5  [get_ports {real_in[15]}]
set_input_transition -min 0.5  [get_ports {real_in[15]}]
set_input_transition -max 0.5  [get_ports {real_in[14]}]
set_input_transition -min 0.5  [get_ports {real_in[14]}]
set_input_transition -max 0.5  [get_ports {real_in[13]}]
set_input_transition -min 0.5  [get_ports {real_in[13]}]
set_input_transition -max 0.5  [get_ports {real_in[12]}]
set_input_transition -min 0.5  [get_ports {real_in[12]}]
set_input_transition -max 0.5  [get_ports {real_in[11]}]
set_input_transition -min 0.5  [get_ports {real_in[11]}]
set_input_transition -max 0.5  [get_ports {real_in[10]}]
set_input_transition -min 0.5  [get_ports {real_in[10]}]
set_input_transition -max 0.5  [get_ports {real_in[9]}]
set_input_transition -min 0.5  [get_ports {real_in[9]}]
set_input_transition -max 0.5  [get_ports {real_in[8]}]
set_input_transition -min 0.5  [get_ports {real_in[8]}]
set_input_transition -max 0.5  [get_ports {real_in[7]}]
set_input_transition -min 0.5  [get_ports {real_in[7]}]
set_input_transition -max 0.5  [get_ports {real_in[6]}]
set_input_transition -min 0.5  [get_ports {real_in[6]}]
set_input_transition -max 0.5  [get_ports {real_in[5]}]
set_input_transition -min 0.5  [get_ports {real_in[5]}]
set_input_transition -max 0.5  [get_ports {real_in[4]}]
set_input_transition -min 0.5  [get_ports {real_in[4]}]
set_input_transition -max 0.5  [get_ports {real_in[3]}]
set_input_transition -min 0.5  [get_ports {real_in[3]}]
set_input_transition -max 0.5  [get_ports {real_in[2]}]
set_input_transition -min 0.5  [get_ports {real_in[2]}]
set_input_transition -max 0.5  [get_ports {real_in[1]}]
set_input_transition -min 0.5  [get_ports {real_in[1]}]
set_input_transition -max 0.5  [get_ports {real_in[0]}]
set_input_transition -min 0.5  [get_ports {real_in[0]}]
set_input_transition -max 0.5  [get_ports {imag_in[15]}]
set_input_transition -min 0.5  [get_ports {imag_in[15]}]
set_input_transition -max 0.5  [get_ports {imag_in[14]}]
set_input_transition -min 0.5  [get_ports {imag_in[14]}]
set_input_transition -max 0.5  [get_ports {imag_in[13]}]
set_input_transition -min 0.5  [get_ports {imag_in[13]}]
set_input_transition -max 0.5  [get_ports {imag_in[12]}]
set_input_transition -min 0.5  [get_ports {imag_in[12]}]
set_input_transition -max 0.5  [get_ports {imag_in[11]}]
set_input_transition -min 0.5  [get_ports {imag_in[11]}]
set_input_transition -max 0.5  [get_ports {imag_in[10]}]
set_input_transition -min 0.5  [get_ports {imag_in[10]}]
set_input_transition -max 0.5  [get_ports {imag_in[9]}]
set_input_transition -min 0.5  [get_ports {imag_in[9]}]
set_input_transition -max 0.5  [get_ports {imag_in[8]}]
set_input_transition -min 0.5  [get_ports {imag_in[8]}]
set_input_transition -max 0.5  [get_ports {imag_in[7]}]
set_input_transition -min 0.5  [get_ports {imag_in[7]}]
set_input_transition -max 0.5  [get_ports {imag_in[6]}]
set_input_transition -min 0.5  [get_ports {imag_in[6]}]
set_input_transition -max 0.5  [get_ports {imag_in[5]}]
set_input_transition -min 0.5  [get_ports {imag_in[5]}]
set_input_transition -max 0.5  [get_ports {imag_in[4]}]
set_input_transition -min 0.5  [get_ports {imag_in[4]}]
set_input_transition -max 0.5  [get_ports {imag_in[3]}]
set_input_transition -min 0.5  [get_ports {imag_in[3]}]
set_input_transition -max 0.5  [get_ports {imag_in[2]}]
set_input_transition -min 0.5  [get_ports {imag_in[2]}]
set_input_transition -max 0.5  [get_ports {imag_in[1]}]
set_input_transition -min 0.5  [get_ports {imag_in[1]}]
set_input_transition -max 0.5  [get_ports {imag_in[0]}]
set_input_transition -min 0.5  [get_ports {imag_in[0]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[15]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[15]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[14]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[14]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[13]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[13]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[12]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[12]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[11]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[11]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[10]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[10]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[9]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[9]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[8]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[8]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[7]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[7]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[6]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[6]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[5]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[5]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[4]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[4]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[3]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[3]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[2]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[2]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[1]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[1]}]
set_input_transition -max 0.5  [get_ports {twiddle_real[0]}]
set_input_transition -min 0.5  [get_ports {twiddle_real[0]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[15]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[15]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[14]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[14]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[13]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[13]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[12]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[12]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[11]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[11]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[10]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[10]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[9]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[9]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[8]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[8]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[7]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[7]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[6]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[6]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[5]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[5]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[4]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[4]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[3]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[3]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[2]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[2]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[1]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[1]}]
set_input_transition -max 0.5  [get_ports {twiddle_imag[0]}]
set_input_transition -min 0.5  [get_ports {twiddle_imag[0]}]
