###################################################################

# Created by write_sdc on Tue Mar 25 16:29:24 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name enG5K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 0.05 [get_ports {data_mem_addr[31]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[30]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[29]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[28]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[27]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[26]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[25]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[24]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[23]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[22]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[21]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[20]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[19]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[18]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[17]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[16]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[15]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[14]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[13]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[12]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[11]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[10]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[9]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[8]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[7]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[6]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[5]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[4]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[3]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[2]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[1]}]
set_load -pin_load 0.05 [get_ports {data_mem_addr[0]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[31]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[30]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[29]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[28]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[27]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[26]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[25]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[24]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[23]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[22]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[21]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[20]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[19]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[18]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[17]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[16]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[15]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[14]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[13]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[12]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[11]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[10]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[9]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[8]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[7]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[6]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[5]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[4]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[3]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[2]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[1]}]
set_load -pin_load 0.05 [get_ports {data_mem_data_out[0]}]
set_load -pin_load 0.05 [get_ports data_mem_write_enable]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rst]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[31]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[30]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[29]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[28]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[27]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[26]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[25]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[24]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[23]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[22]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[21]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[20]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[19]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[18]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[17]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[16]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[15]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[14]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[13]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[12]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[11]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[10]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[9]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[8]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[7]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[6]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[5]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[4]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[3]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[2]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[1]}]
set_max_capacitance 0.15 [get_ports {instruction_mem_data_in[0]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[31]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[30]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[29]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[28]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[27]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[26]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[25]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[24]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[23]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[22]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[21]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[20]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[19]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[18]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[17]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[16]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[15]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[14]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[13]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[12]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[11]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[10]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[9]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[8]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[7]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[6]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[5]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[4]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[3]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[2]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[1]}]
set_max_capacitance 0.15 [get_ports {data_mem_data_in[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst]
set_max_fanout 10 [get_ports {instruction_mem_data_in[31]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[30]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[29]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[28]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[27]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[26]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[25]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[24]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[23]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[22]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[21]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[20]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[19]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[18]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[17]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[16]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[15]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[14]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[13]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[12]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[11]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[10]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[9]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[8]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[7]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[6]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[5]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[4]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[3]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[2]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[1]}]
set_max_fanout 10 [get_ports {instruction_mem_data_in[0]}]
set_max_fanout 10 [get_ports {data_mem_data_in[31]}]
set_max_fanout 10 [get_ports {data_mem_data_in[30]}]
set_max_fanout 10 [get_ports {data_mem_data_in[29]}]
set_max_fanout 10 [get_ports {data_mem_data_in[28]}]
set_max_fanout 10 [get_ports {data_mem_data_in[27]}]
set_max_fanout 10 [get_ports {data_mem_data_in[26]}]
set_max_fanout 10 [get_ports {data_mem_data_in[25]}]
set_max_fanout 10 [get_ports {data_mem_data_in[24]}]
set_max_fanout 10 [get_ports {data_mem_data_in[23]}]
set_max_fanout 10 [get_ports {data_mem_data_in[22]}]
set_max_fanout 10 [get_ports {data_mem_data_in[21]}]
set_max_fanout 10 [get_ports {data_mem_data_in[20]}]
set_max_fanout 10 [get_ports {data_mem_data_in[19]}]
set_max_fanout 10 [get_ports {data_mem_data_in[18]}]
set_max_fanout 10 [get_ports {data_mem_data_in[17]}]
set_max_fanout 10 [get_ports {data_mem_data_in[16]}]
set_max_fanout 10 [get_ports {data_mem_data_in[15]}]
set_max_fanout 10 [get_ports {data_mem_data_in[14]}]
set_max_fanout 10 [get_ports {data_mem_data_in[13]}]
set_max_fanout 10 [get_ports {data_mem_data_in[12]}]
set_max_fanout 10 [get_ports {data_mem_data_in[11]}]
set_max_fanout 10 [get_ports {data_mem_data_in[10]}]
set_max_fanout 10 [get_ports {data_mem_data_in[9]}]
set_max_fanout 10 [get_ports {data_mem_data_in[8]}]
set_max_fanout 10 [get_ports {data_mem_data_in[7]}]
set_max_fanout 10 [get_ports {data_mem_data_in[6]}]
set_max_fanout 10 [get_ports {data_mem_data_in[5]}]
set_max_fanout 10 [get_ports {data_mem_data_in[4]}]
set_max_fanout 10 [get_ports {data_mem_data_in[3]}]
set_max_fanout 10 [get_ports {data_mem_data_in[2]}]
set_max_fanout 10 [get_ports {data_mem_data_in[1]}]
set_max_fanout 10 [get_ports {data_mem_data_in[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rst]
set_max_transition 3 [get_ports {instruction_mem_data_in[31]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[30]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[29]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[28]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[27]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[26]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[25]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[24]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[23]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[22]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[21]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[20]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[19]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[18]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[17]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[16]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[15]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[14]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[13]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[12]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[11]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[10]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[9]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[8]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[7]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[6]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[5]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[4]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[3]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[2]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[1]}]
set_max_transition 3 [get_ports {instruction_mem_data_in[0]}]
set_max_transition 3 [get_ports {data_mem_data_in[31]}]
set_max_transition 3 [get_ports {data_mem_data_in[30]}]
set_max_transition 3 [get_ports {data_mem_data_in[29]}]
set_max_transition 3 [get_ports {data_mem_data_in[28]}]
set_max_transition 3 [get_ports {data_mem_data_in[27]}]
set_max_transition 3 [get_ports {data_mem_data_in[26]}]
set_max_transition 3 [get_ports {data_mem_data_in[25]}]
set_max_transition 3 [get_ports {data_mem_data_in[24]}]
set_max_transition 3 [get_ports {data_mem_data_in[23]}]
set_max_transition 3 [get_ports {data_mem_data_in[22]}]
set_max_transition 3 [get_ports {data_mem_data_in[21]}]
set_max_transition 3 [get_ports {data_mem_data_in[20]}]
set_max_transition 3 [get_ports {data_mem_data_in[19]}]
set_max_transition 3 [get_ports {data_mem_data_in[18]}]
set_max_transition 3 [get_ports {data_mem_data_in[17]}]
set_max_transition 3 [get_ports {data_mem_data_in[16]}]
set_max_transition 3 [get_ports {data_mem_data_in[15]}]
set_max_transition 3 [get_ports {data_mem_data_in[14]}]
set_max_transition 3 [get_ports {data_mem_data_in[13]}]
set_max_transition 3 [get_ports {data_mem_data_in[12]}]
set_max_transition 3 [get_ports {data_mem_data_in[11]}]
set_max_transition 3 [get_ports {data_mem_data_in[10]}]
set_max_transition 3 [get_ports {data_mem_data_in[9]}]
set_max_transition 3 [get_ports {data_mem_data_in[8]}]
set_max_transition 3 [get_ports {data_mem_data_in[7]}]
set_max_transition 3 [get_ports {data_mem_data_in[6]}]
set_max_transition 3 [get_ports {data_mem_data_in[5]}]
set_max_transition 3 [get_ports {data_mem_data_in[4]}]
set_max_transition 3 [get_ports {data_mem_data_in[3]}]
set_max_transition 3 [get_ports {data_mem_data_in[2]}]
set_max_transition 3 [get_ports {data_mem_data_in[1]}]
set_max_transition 3 [get_ports {data_mem_data_in[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  -max 5  [get_ports rst]
set_input_delay -clock clk  -min 0  [get_ports rst]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[31]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[31]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[30]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[30]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[29]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[29]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[28]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[28]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[27]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[27]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[26]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[26]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[25]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[25]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[24]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[24]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[23]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[23]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[22]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[22]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[21]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[21]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[20]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[20]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[19]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[19]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[18]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[18]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[17]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[17]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[16]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[16]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[15]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[15]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[14]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[14]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[13]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[13]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[12]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[12]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[11]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[11]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[10]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[10]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[9]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[9]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[8]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[8]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[7]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[7]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[6]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[6]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[5]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[5]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[4]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[4]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[3]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[2]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[1]}]
set_input_delay -clock clk  -max 5  [get_ports {instruction_mem_data_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {instruction_mem_data_in[0]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[31]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[31]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[30]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[30]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[29]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[29]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[28]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[28]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[27]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[27]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[26]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[26]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[25]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[25]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[24]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[24]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[23]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[23]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[22]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[22]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[21]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[21]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[20]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[20]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[19]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[19]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[18]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[18]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[17]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[17]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[16]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[16]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[15]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[15]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[14]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[14]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[13]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[13]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[12]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[12]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[11]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[11]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[10]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[10]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[9]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[9]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[8]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[8]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[7]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[7]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[6]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[6]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[5]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[5]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[4]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[4]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[3]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[2]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[1]}]
set_input_delay -clock clk  -max 5  [get_ports {data_mem_data_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {data_mem_data_in[0]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[31]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[31]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[30]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[30]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[29]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[29]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[28]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[28]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[27]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[27]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[26]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[26]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[25]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[25]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[24]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[24]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[23]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[23]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[22]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[22]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[21]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[21]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[20]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[20]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[19]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[19]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[18]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[18]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[17]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[17]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[16]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[16]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[15]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[15]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[14]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[14]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[13]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[13]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[12]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[12]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[11]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[11]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[10]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[10]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[9]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[9]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[8]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[8]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[7]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[7]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[6]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[6]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[5]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[5]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[4]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[4]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[3]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[3]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[2]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[2]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[1]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[1]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_addr[0]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_addr[0]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[31]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[31]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[30]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[30]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[29]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[29]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[28]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[28]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[27]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[27]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[26]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[26]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[25]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[25]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[24]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[24]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[23]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[23]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[22]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[22]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[21]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[21]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[20]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[20]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[19]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[19]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[18]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[18]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[17]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[17]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[16]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[16]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[15]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[15]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[14]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[14]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[13]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[13]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[12]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[12]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[11]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[11]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[10]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[10]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[9]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[9]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[8]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[8]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[7]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[7]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[6]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[6]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[5]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[5]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[4]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[4]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[3]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[3]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[2]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[2]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[1]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[1]}]
set_output_delay -clock clk  -max 5  [get_ports {data_mem_data_out[0]}]
set_output_delay -clock clk  -min 0  [get_ports {data_mem_data_out[0]}]
set_output_delay -clock clk  -max 5  [get_ports data_mem_write_enable]
set_output_delay -clock clk  -min 0  [get_ports data_mem_write_enable]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
set_input_transition -max 0.5  [get_ports rst]
set_input_transition -min 0.5  [get_ports rst]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[31]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[31]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[30]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[30]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[29]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[29]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[28]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[28]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[27]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[27]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[26]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[26]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[25]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[25]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[24]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[24]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[23]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[23]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[22]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[22]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[21]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[21]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[20]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[20]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[19]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[19]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[18]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[18]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[17]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[17]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[16]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[16]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[15]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[15]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[14]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[14]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[13]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[13]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[12]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[12]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[11]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[11]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[10]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[10]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[9]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[9]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[8]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[8]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[7]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[7]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[6]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[6]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[5]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[5]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[4]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[4]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[3]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[3]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[2]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[2]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[1]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[1]}]
set_input_transition -max 0.5  [get_ports {instruction_mem_data_in[0]}]
set_input_transition -min 0.5  [get_ports {instruction_mem_data_in[0]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[31]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[31]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[30]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[30]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[29]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[29]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[28]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[28]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[27]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[27]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[26]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[26]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[25]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[25]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[24]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[24]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[23]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[23]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[22]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[22]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[21]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[21]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[20]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[20]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[19]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[19]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[18]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[18]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[17]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[17]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[16]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[16]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[15]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[15]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[14]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[14]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[13]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[13]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[12]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[12]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[11]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[11]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[10]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[10]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[9]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[9]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[8]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[8]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[7]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[7]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[6]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[6]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[5]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[5]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[4]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[4]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[3]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[3]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[2]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[2]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[1]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[1]}]
set_input_transition -max 0.5  [get_ports {data_mem_data_in[0]}]
set_input_transition -min 0.5  [get_ports {data_mem_data_in[0]}]
